Repository: volard/DB_app
Catalog: DB_app/Strings/*/Resources.resw
Source language: en_us
Languages: ru_ru

# AppDisplayName
source: Medicine management system
ru_ru: MMS - Система менеджмента лекарств

# AppDescription
source: Educational project dedicated to developing simple yet modern Windows applications using WinUI 3.0 and Windows App SDK
ru_ru: Образовательный проект, посвященный разработке простых, но современных Windows-приложений с использованием WinUI 3.0 и Windows App SDK

# Shell_Greeting.Content
source: Main
ru_ru: Главная

# Shell_HospitalsGrid.Content
source: Hospitals
ru_ru: Больницы

# Shell_MedicinesGrid.Content
source: Medicines
ru_ru: Медикаманты

# Shell_OrdersGrid.Content
source: Orders
ru_ru: Заказы

# Shell_PharmaciesGrid.Content
source: Pharmacies
ru_ru: Аптеки

# Shell_ProductsGrid.Content
source: Products
ru_ru: Продукты

# Shell_PharmacyReportGrid.Content
source: Pharmacies' report
ru_ru: Отчет по аптекам

# Shell_HospitalReportGrid.Content
source: Hospitals' report
ru_ru: Отчет по больницам

# Settings_Personalization.Text
source: Personalization
ru_ru: Персонализация

# Settings_Theme.Text
source: Theme
ru_ru: Тема

# Settings_Theme_Light.Content
source: Light
ru_ru: Светлая

# Settings_Theme_Dark.Content
source: Dark
ru_ru: Темная

# Settings_Theme_Default.Content
source: System
ru_ru: Системная

# Settings_About.Text
source: About this application
ru_ru: О приложении

# Settings_AboutDescription.Text
source: Educational project dedicated to developing simple yet modern Windows applications using WinUI 3.0 and Windows App SDK
ru_ru: Учебное приложение, которое старается быть максимально enterprise

# Shell_AddressesGrid.Content
source: Addresses
ru_ru: Адреса

# RecordForDeletionNotFoundException
source: The record to deletion not found
ru_ru: Запись для удаления не найдена

# Address.Text
source: Address
ru_ru: Адрес

# Hospital.Text
source: Hospital
ru_ru: Больница

# Medicine.Text
source: Medicine
ru_ru: Медикамент

# Order.Text
source: Order
ru_ru: Заказ

# Pharmacy.Text
source: Pharmacy
ru_ru: Аптека

# Product.Text
source: Product
ru_ru: Продукт

# Settings.Text
source: Settings
ru_ru: Настройки

# Edit.Text
source: Edit
ru_ru: Изменить

# New.Text
source: New
ru_ru: Создание

source: New hospital
ru_ru: Новая больница

# Hospitals.Text
source: Hospitals
ru_ru: Больницы

source: New order
ru_ru: Новый заказ

source: New address
ru_ru: Новый адрес

source: New medicine
ru_ru: Новый медикамент

source: New product
ru_ru: Новый продукт

# Addresses.Text
source: Addresses
ru_ru: Адреса

# Medicines.Text
source: Medicines
ru_ru: Лекарства

source: New pharmacy
ru_ru: Новая аптека

# Orders.Text
source: Orders
ru_ru: Заказы

# Pharmacies.Text
source: Pharmacies
ru_ru: Аптеки

# Products.Text
source: Products
ru_ru: Продукты

# SaveDialog.CloseButtonText
source: Cancel
ru_ru: Отмена

# SaveDialog.SecondaryButtonText
source: Don't save
ru_ru: Не сохранять

# SaveDialog.PrimaryButtonText
source: Save
ru_ru: Сохранить

# SaveDialog.Title
source: Save changes?
ru_ru: Сохранить изменения?

# SaveDialog.Content
source: You have unsaved changes that will be lost. Would you like to save your changes?
ru_ru: Несохраненные изменения будут удалены. Хотите их сохранить?

# Warning.Header
source: Warning
ru_ru: Внимание

# Name.Text
source: Name
ru_ru: Название

# Type.Header
source: Type
ru_ru: Тип

# NameHeader.Header
source: Name
ru_ru: Название

# Shell_Reports.Content
source: Reports
ru_ru: Отчеты

# Shell_Reports_HospitalsWithMedicine.Content
source: Hospitals with medicine
ru_ru: Больницы с лекарством

# Shell_Reports_MedicineInHospital.Content
source: Medicine in hospital
ru_ru: Лекарства в больнице

# Shell_Reports_MedicineInPharmacy.Content
source: Medicine in pharmacy
ru_ru: Лекарства в аптеке

# Shell_Reports_PharmacyBudget.Content
source: Pharmacies budget
ru_ru: Бюджет аптек

# Shell_Reports_PharmacyWithMedicine.Content
source: Pharmacy with medicine
ru_ru: Аптеки с лекарством

# AddNewButton.Label
source: Add
ru_ru: Добавить

# BudgetHeader.Header
source: Budget
ru_ru: Бюджет

# Building.Header
source: Building
ru_ru: Здание

# CancelButton.Label
source: Cancel
ru_ru: Отмена

# City.Header
source: City
ru_ru: Город

# Data.Content
source: Data
ru_ru: Данные

# DateHeader.Header
source: Date
ru_ru: Дата

# DeleteButton.Label
source: Delete
ru_ru: Удалить

# Doctor.Header
source: Doctor
ru_ru: ГлавВрач

# DoctorMiddlename.Header
source: Doctor middlename
ru_ru: Отчетсво

# DoctorName.Header
source: Doctor name
ru_ru: Имя

# DoctorSurename.Header
source: Doctor surename
ru_ru: Фамилия

# EditButton.Label
source: Edit
ru_ru: Изменить

# ExportButton.Label
source: Export
ru_ru: Экспорт

# HospitalHeader.Header
source: Hospital
ru_ru: Больница

# HospitalsWithMedicineDescription.Message
source: All hospitals where selected medicine exists
ru_ru: Больницы, где имеется выбранное лекарство

# HospitalsWithMedicineDescription.Title
source: Description
ru_ru: Описание

# HospitalWithMedicine.Text
source: Hospital with medicine
ru_ru: Больницы с лекарством

# MedicineHeader.Header
source: Medicine
ru_ru: Лекарство

# MedicineInHospital.Text
source: Medicine in hospital
ru_ru: Лекарства в больнице

# MedicineInHospitalDescription.Message
source: All medicine in selected hospital
ru_ru: Список лекарств, купленных определенной больницей, упорядоченный по виду, с указанием общего количества упаковок каждого вида.

# MedicineInHospitalDescription.Title
source: Description
ru_ru: Описание

# MedicineInPharmacy.Text
source: Medicine in pharmacy
ru_ru: Лекарства в аптеке

# MedicineInPharmacyDescription.Message
source: All medicine in selected pharmacy
ru_ru: Список лекарств, имеющихся в определенной аптеке, упорядоченный по их названиям

# MedicineInPharmacyDescription.Title
source: Description
ru_ru: Описание

# NotFound.Text
source: Not found
ru_ru: Не найдено

# OpenWindowButton.Label
source: Open in new window
ru_ru: Открыть в новом окне

# PharmaciesBudget.Text
source: Pharmacies budget
ru_ru: Бюджет аптек

# PharmaciesBudgetDescription.Message
source: Pharmacies' budget
ru_ru: Бюджет аптек

# PharmaciesBudgetDescription.Title
source: Description
ru_ru: Описание

# PharmacyHeader.Header
source: Pharmacy
ru_ru: Аптека

# PharmacyWithMedicine.Text
source: Pharmacy with medicine
ru_ru: Аптеки с лекарством

# PharmacyWithMedicineDescription.Message
source: Pharmacies, wich sell selected medicine
ru_ru: Аптеки, которые продают выбранное лекарство

# PharmacyWithMedicineDescription.Title
source: Description
ru_ru: Описание

# PriceHeader.Header
source: Price
ru_ru: Цена

# QuantityHeader.Header
source: Quantity
ru_ru: Количество

# SaveButton.Label
source: Save
ru_ru: Сохранить

# ShippingAddressHeader.Header
source: Shipping address
ru_ru: Адрес доставки

# Street.Header
source: Street
ru_ru: Улица

# TimeHeader.Header
source: Time
ru_ru: Время

# TotalHeader.Header
source: Total
ru_ru: Итого

# ViewButton.Label
source: View
ru_ru: Подробнее

# AddSelectedButton.Label
source: Add selected
ru_ru: Добавить выбранное

# BuildingInput.HeaderText
source: Building
ru_ru: Здание

# BuildingInput.PlaceholderText
source: Enter building
ru_ru: Введите здание

# CityInput.HeaderText
source: City
ru_ru: Город

# CityInput.PlaceholderText
source: Enter city
ru_ru: Введите город

# MakeInactiveButton.Content
source: Make inactive
ru_ru: Деактивировать

# MiddlenameInput.HeaderText
source: Maindoctor middlename
ru_ru: Отчество

# MiddlenameInput.PlaceholderText
source: Enter middlename
ru_ru: Введите отчество

# NameInput.HeaderText
source: Maindoctor name
ru_ru: Имя

# NameInput.PlaceholderText
source: Enter name
ru_ru: Введите имя

# StreetInput.HeaderText
source: Street
ru_ru: Улица

# StreetInput.PlaceholderText
source: Enter street
ru_ru: Введите улицу

# SurenameInput.HeaderText
source: Maindoctor surename
ru_ru: Фамилия

# SurenameInput.PlaceholderText
source: Enter surename
ru_ru: Введите фамилию

# ZeroAddressesInfo.Content
source: At least one address have to be provided otherwise organization becomes inactive
ru_ru: Хотя бы один адрес должен быть добавлен, иначе организация будет деактивирована безвозвратно

# MedicineNameInput.HeaderText
source: Medicine name
ru_ru: Название

# MedicineNameInput.PlaceholderText
source: Enter name
ru_ru: Введите название

# MedicineTypeInput.HeaderText
source: Type
ru_ru: Тип

# MedicineTypeInput.PlaceholderText
source: Enter type
ru_ru: Введите тип

# CustomerHeader.Header
source: Customer
ru_ru: Покупатель

# DatePlacedText.Text
source: Date placed
ru_ru: Дата заказа

# HospitalCustomerComboBox.Header
source: Customer
ru_ru: Покупатель

# HospitalCustomerComboBox.PlaceholderText
source: Select hospital
ru_ru: Выберите больницу

# OrderItemsText.Text
source: Order items
ru_ru: Детали заказа

# PriceText.Text
source: Price
ru_ru: Цена

# QuantityText.Text
source: Quantity
ru_ru: Количество

# ShippingAddressComboBox.Header
source: Shipping adderss
ru_ru: Адрес доставки

# TotalText.Text
source: Total
ru_ru: Итого

# TypeText.Text
source: Type
ru_ru: Вид

# NewAddressComboBox.PlaceholderText
source: Select new address
ru_ru: Выберите новый адрес

# PharmacyNameInput.HeaderText
source: Pharmacy name
ru_ru: Название аптеки

# PharmacyNameInput.PlaceholderText
source: Enter name
ru_ru: Введите название

# PriceInput.Header
source: Price
ru_ru: Цена

# PriceInput.PlaceholderText
source: Enter price value
ru_ru: Введите значение цены

# QuantityInput.Header
source: Quantity
ru_ru: Количество

# QuantityInput.PlaceholderText
source: Enter quantity value
ru_ru: Введите количество

# DoctorText.Text
source: Doctor
ru_ru: ГлавВрач

# MedicineComboBox.Header
source: Medicine
ru_ru: Лекарство

# MedicineComboBox.PlaceholderText
source: Select medicine
ru_ru: Выберите лекарство

# PharmacyComboBox.Header
source: Pharmacy
ru_ru: Аптека

# PharmacyComboBox.PlaceholderText
source: Select pharmacy
ru_ru: Выберите аптеку
